Revit 2027 API
SlabShapeCreaseArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SlabShapeCrease this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As SlabShapeCrease
	Get
	Set
public:
virtual property SlabShapeCrease^ Item[int index] {
	SlabShapeCrease^ get (int index);
	void set (int index, SlabShapeCrease^ value);
}
abstract Item : SlabShapeCrease with get, set
override Item : SlabShapeCrease with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
SlabShapeCrease
Returns the object at the specified index.
See Also
Reference
SlabShapeCreaseArray Class
Autodesk.Revit.DB Namespace